Revit 2025 API
PipingSystemType.FluidTemperature Property
 Fluid Temperature, in Kelvin.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double FluidTemperature { get; set; }
Public Property FluidTemperature As Double
	Get
	Set
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
member FluidTemperature : float with get, set
Property Value
Double
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace